test/site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no

#+STARTUP: indent

#+MACRO: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+MACRO: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+MACRO: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+MACRO: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]

#+AUTHOR:

*** Invalid Date                                                    :invalid:
:PROPERTIES:
:EXPORT_FILE_NAME: invalid-date
:EXPORT_DATE: 2012-2017
:END:
It's possible that someone is using an existing Org file to export to
Hugo. Some exporters like =ox-texinfo= recognize dates of style
=YEAR1-YEAR2= to use them in Copyright headers.

But that date is invalid as per the standard date format used by Hugo
in =date= front-matter, and also as per =org-parse-time-string=.

So in that case, don't allow =org-parse-time-string= to throw an error
and abort the export, but instead simply don't set the =date= in the
front-matter.

In this post the =:EXPORT_DATE:= property is set to =2012-2017=, but
the export will still happen fine, with the =date= front-matter not
set.
